Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutTime_millisecond
source: The millisecond component.
bg_bg: Компонентът на милисекундата.
ca_es: Component de mil·lisegon.
cs_cz: Milisekundy
da_dk: Millisekund-komponenten.
de_de: Die Millisekundenkomponente.
el_gr: Το στοιχείο χιλιοστού του δευτερολέπτου.
es_es: Componente de milisegundo.
et_ee: Millisekundikomponent.
eu_es: Milisegundo-osagaia.
fi_fi: Millisekuntikomponentti.
fr_fr: Composant milliseconde.
gl_es: Compoñente milisegundo.
hi_in: मिलीसेकंड घटक.
hr_hr: Komponenta milisekunde.
hu_hu: Az ezredmásodperc összetevő.
it_it: Componente millisecondo.
ja_jp: ミリ秒コンポーネント。
kk_kz: Миллисекунд компоненті.
ko_kr: 밀리초 구성 요소입니다.
lt_lt: Milisekundės komponentas.
lv_lv: Milisekundes komponents.
ms_my: Komponen milisaat.
nb_no: Millisekundkomponenten.
nl_nl: Het millisecondegedeelte.
pl_pl: Składnik milisekundy.
pt_br: Componente de milésimo de segundo.
pt_pt: Componente de milissegundos.
ro_ro: Componenta milisecundă.
ru_ru: Компонент миллисекунд.
sk_sk: Komponent milisekúnd.
sl_si: Komponenta milisekunde.
sr_cyrl_rs: Компонента милисекунде.
sr_latn_rs: Komponenta milisekunde.
sv_se: Millisekund-komponenten.
th_th: คอมโพเนนต์มิลลิวินาที
tr_tr: Milisaniye bileşeni.
uk_ua: Компонент мілісекунди.
vi_vn: Thành phần mili giây.
zh_cn: 毫秒部分。
zh_tw: 毫秒元件。

# AboutYear
source: Year returns the year of a given date, a number greater than 1900.
bg_bg: Функцията „Година“ връща годината на дадена дата като число, по-голямо от 1900.
ca_es: Any retorna l'any d'una data proporcionada, un nombre més gran que 1900.
cs_cz: Funkce Year vrátí rok zadaného data, číslo větší než 1900.
da_dk: År returnerer den givne datos år, et tal større end 1900.
de_de: "Year" gibt das Jahr für ein bestimmtes Datum zurück, eine Zahl größer als 1900.
el_gr: Το Έτος επιστρέφει το έτος μιας δεδομένης ημερομηνίας, έναν αριθμό μεγαλύτερο από 1900.
es_es: Año devuelve el año de una fecha concreta, un número mayor que 1900.
et_ee: Aasta tagastab määratud kuupäeva aasta, mis on 1900-st suurem arv.
eu_es: "Year" funtzioak emandako data baten urtea itzultzen du (1900 baino handiagoa den zenbaki bat).
fi_fi: Vuosi palauttaa annetun päivämäärän vuoden lukuna, joka on suurempi kuin 1900.
fr_fr: Année retourne l’année d’une date donnée, un nombre supérieur à 1900.
gl_es: Ano devolve o ano dunha data indicada, un número maior que 1900.
hi_in: वर्ष, दिए गए दिनांक का वर्ष लौटाता है, जो कि 1900 से बड़ी संख्या होती है.
hr_hr: Funkcija Year vraća godinu zadanog datuma, broj veći od 1900.
hu_hu: A Year függvény egy adott dátum év részét adja vissza.
it_it: Anno restituisce l'anno di una data specificata, con un numero maggiore di 1900.
ja_jp: Year は、指定の日付の年を 1900 より大きい数値として返します。
kk_kz: Жыл 1900 мәнінен үлкен сан болатын берілген күннің жылын қайтарады.
ko_kr: 연도는 1900보다 큰, 지정된 날짜의 연도를 반환합니다.
lt_lt: „Year“ pateikia nurodytos datos metus – skaičių, didesnį už 1900.
lv_lv: Gads atgriež norādīta datuma gadu, skaitli, kas lielāks par 1900.
ms_my: Tahun mengembalikan tahun bagi suatu tarikh yang diberikan yang nombornya lebih besar daripada 1900.
nb_no: År returnerer året for en gitt dato, et tall som er større enn 1900.
nl_nl: Jaar retourneert het jaar voor de desbetreffende datum, een getal groter dan 1900.
pl_pl: Rok zwraca numer roku danej daty, czyli liczbę większą niż 1900.
pt_br: Year retorna o ano de determinada data, um número maior que 1900.
pt_pt: Year devolve o ano de uma data determinada, um número superior a 1900.
ro_ro: Anul returnează anul unei anumite date, un număr mai mare decât 1900.
ru_ru: Функция Year возвращает год для заданной даты в виде числа, большего 1900.
sk_sk: Funkcia Rok vracia rok daného dátumu, číslo väčšie ako 1900.
sl_si: Leto vrne leto navedenega datuma, število, ki je večje od 1900.
sr_cyrl_rs: Година враћа годину датог датума, број већи од 1900.
sr_latn_rs: Godina vraća godinu za dati datum.
sv_se: År returnerar året för ett givet datum, ett tal större än 1900.
th_th: ปี ส่งกลับปีของวันที่ที่ระบุ เป็นตัวเลขที่มากกว่า 1900
tr_tr: Yıl, 1900'den büyük bir sayı olarak sağlanan bir tarihin yılını döndürür.
uk_ua: Функція "Рік" повертає рік указаної дати (число, більше за 1900).
vi_vn: Năm trả về năm hoặc ngày được cho trước, một số lớn hơn 1900.
zh_cn: Year 返回给定日期的年份，大于 1900 的数字。
zh_tw: Year 會傳回指定日期的年度 (大於 1900 的數字)。

# YearArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutYear_date_time
source: A date value from which the year component will be extracted.
bg_bg: Стойността на дата, от която ще се извлече компонентът на годината.
ca_es: Valor de data del qual s'extraurà el component d'any.
cs_cz: Hodnota data, ze které se bude extrahovat rok
da_dk: En datoværdi, hvorfra år-komponenten bliver udtrukket.
de_de: Ein Datumswert, aus dem die Jahreskomponente extrahiert werden soll.
el_gr: Μια τιμή ημερομηνίας από την οποία θα εξαχθεί το στοιχείο έτους.
es_es: Un valor de fecha del que se extraerá el componente de año.
et_ee: Kuupäevaväärtus, millest ekstraktitakse aastakomponent.
eu_es: Data-balioa, nondik "urtea" osagaia aterako den.
fi_fi: Päivämääräarvo, josta vuosikomponentti poimitaan.
fr_fr: Valeur de date dont le composant année sera extrait.
gl_es: Valor de data do cal se extraerá o compoñente "ano".
hi_in: दिनांक का ऐसा मान जिससे वर्ष घटक का निष्कर्षण किया जाएगा.
hr_hr: Vrijednost datuma iz koje će se komponenta godine izdvojiti.
hu_hu: Az a dátumérték, amelyből a függvény kinyeri az év összetevőt.
it_it: Valore data dal quale verrà estratto il componente relativo all'anno.
ja_jp: 年コンポーネントを抽出する元となる日付の値。
kk_kz: Жыл компоненті алынатын күн мәні.
ko_kr: 연도 구성 요소가 추출되는 날짜 값입니다.
lt_lt: Datos reikšmė, iš kurios bus išgautas metų komponentas.
lv_lv: Datuma vērtība, no kuras gada komponents tiks izgūts.
ms_my: Nilai tarikh daripada mana komponen tahun akan diekstrak.
nb_no: En datoverdi som komponenten for år blir trukket ut fra.
nl_nl: Een datumwaarde waaruit het jaargedeelte wordt geëxtraheerd.
pl_pl: Wartość daty, z której zostanie wyodrębniony składnik roku.
pt_br: Valor de data do qual o componente de ano será extraído.
pt_pt: Um valor de data a partir do qual o componente ano será extraído.
ro_ro: O valoare dată din care va fi extrasă componenta an.
ru_ru: Значение даты, из которого будет извлекаться компонент года.
sk_sk: Dátumová hodnota, z ktorej sa vyextrahuje komponent roka.
sl_si: Datumska vrednost, iz katere bo izvlečena komponenta leta.
sr_cyrl_rs: Вредност датума из које ће компонента године бити издвојена.
sr_latn_rs: Vrednost datuma iz koje će komponenta godine biti izdvojena.
sv_se: Ett datumvärde från vilket årskomponenten extraheras.
th_th: ค่าวันที่ที่จะถูกแยกจากคอมโพเนนท์ year
tr_tr: Yıl bileşeninin ayıklanacağı bir tarih değeri.
uk_ua: Значення дати, звідки потрібно видобувати компонент року.
vi_vn: Giá trị ngày, trong đó thành phần năm sẽ được trích xuất.
zh_cn: 将从中提取年份部分的日期值。
zh_tw: 擷取其年度元件的日期值。

# AboutMonth
source: Returns the month, a number from 1 (January) to 12 (December).
bg_bg: Връща месеца като число от 1 (януари) до 12 (декември).
ca_es: Retorna el mes, un nombre de l'1 (gener) al 12 (desembre).
cs_cz: Vrátí měsíc, číslo od 1 (leden) do 12 (prosinec).
da_dk: Returnerer måneden, et tal fra 1 (januar) til 12 (december).
de_de: Gibt den Monat zurück, eine Zahl von 1 (Januar) bis 12 (Dezember).
el_gr: Επιστρέφει το μήνα, έναν αριθμό από 1 (Ιανουάριος) έως 12 (Δεκέμβριος).
es_es: Devuelve el mes, un número entre 1 (enero) y 12 (diciembre).
et_ee: Tagastab kuu, mis on arv vahemikus 1 (jaanuar) kuni 12 (detsember).
eu_es: Hilabetea itzultzen du (1 urtarrila eta 12 abendua arteko zenbaki bat).
fi_fi: Palauttaa kuukauden lukuna välillä 1 (tammikuu) ja 12 (joulukuu).
fr_fr: Retourne le mois, un chiffre de 1 (janvier) à 12 (décembre).
gl_es: Devolve o mes, un número de 1 (xaneiro) a 12 (decembro).
hi_in: माह लौटाता है, जो कि 1 (जनवरी) से 12 (दिसंबर) तक की संख्या है.
hr_hr: Vraća mjesec, broj od 1 (siječanj) do 12 (prosinac).
hu_hu: A hónapot jelző, 1 (január) és 12 (december) közötti számot adja vissza.
it_it: Restituisce il mese, ovvero un numero compreso tra 1 (gennaio) e 12 (dicembre).
ja_jp: 月を返します。1 (1 月) から 12 (12 月) までの数値です。
kk_kz: 1 (қаңтар) және 12 (желтоқсан) арасындағы сан болатын айды қайтарады.
ko_kr: 1(1월) ~ 12(12월) 사이의 월(숫자)을 반환합니다.
lt_lt: Pateikia mėnesį – skaičių nuo 1 (sausis) iki 12 (gruodis).
lv_lv: Atgriež mēnesi, skaitli no 1 (janvāris) līdz 12 (decembris).
ms_my: Mengembalikan bulan, satu nombor dari 1 (Januari) hingga 12 (Disember).
nb_no: Returnerer måneden, som er et tall fra 1 (januar) til 12 (desember).
nl_nl: Hiermee wordt de maand geretourneerd, een getal tussen 1 (januari) en 12 (december).
pl_pl: Zwraca miesiąc w formie liczby od 1 (styczeń) do 12 (grudzień).
pt_br: Retorna o mês, um número entre 1 (janeiro) e 12 (dezembro).
pt_pt: Devolve o mês, um número desde 1 (janeiro) a 12 (dezembro).
ro_ro: Returnează luna, un număr de la 1 (ianuarie) la 12 (decembrie).
ru_ru: Возвращает месяц в виде числа от 1 (январь) до 12 (декабрь).
sk_sk: Vráti mesiac – číslo v rozsahu 1 (január) až 12 (december).
sl_si: Vrne mesec, število med 1 (januar) in 12 (december).
sr_cyrl_rs: Враћа месец, број од 1 (јануар) до 12 (децембар).
sr_latn_rs: Vraća mesec, broj od 1 (januar) do 12 (decembar).
sv_se: Returnerar månaden, ett tal från 1 (januari) till 12 (december).
th_th: ส่งกลับค่าเดือนเป็นตัวเลขจาก 1 (มกราคม) ถึง 12 (ธันวาคม)
tr_tr: Ayı (1 (Ocak) ile 12 (Aralık) arasında bir sayı) döndürür.
uk_ua: Повертає місяць (число від 1 (січень) до 12 (грудень)).
vi_vn: Trả về tháng, một số nằm trong khoảng từ 1 (tháng 1) đến 12 (tháng 12).
zh_cn: 返回月份，从 1 (一月)到 12 (十二月)的数字。
zh_tw: 傳回月份，介於 1 (一月) 到 12 (十二月) 之間的數字。

# MonthArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutMonth_date_time
source: The date value from which the month component will be extracted.
bg_bg: Стойността на дата, от която ще се извлече компонентът на месеца.
ca_es: Valor de data del qual s'extraurà el component de mes.
cs_cz: Hodnota data, ze které se bude extrahovat měsíc
da_dk: Datoværdien, hvorfra måned-komponenten bliver udtrukket.
de_de: Der Datumswert, aus dem die Monatskomponente extrahiert werden soll.
el_gr: Η τιμή ημερομηνίας από την οποία θα εξαχθεί το στοιχείο μήνα.
es_es: Valor de fecha del que se va a extraer el componente de mes.
et_ee: Kuupäevaväärtus, millest ekstraktitakse kuukomponent.
eu_es: Hilabete-osagaia ateratzeko erabiliko den data-balioa.
fi_fi: Päivämääräarvo, josta kuukausikomponentti poimitaan.
fr_fr: Valeur de date dont le composant mois sera extrait.
gl_es: Valor de data do que se vai extraer o compoñente "mes".
hi_in: वह दिनांक मान जिससे माह घटक निकाला जाना है.
hr_hr: Vrijednost datuma iz koje će se komponenta mjeseca izdvojiti.
hu_hu: Az a dátumérték, amelyből a függvény kinyeri a hónap összetevőt.
it_it: Valore data dal quale verrà estratto il componente relativo al mese.
ja_jp: 月コンポーネントを抽出する元となる日付の値。
kk_kz: Ай компоненті алынатын күн мәні.
ko_kr: 월 구성 요소가 추출되는 날짜 값입니다.
lt_lt: Datos reikšmė, iš kurios bus išgautas mėnesio komponentas.
lv_lv: Datuma vērtība, no kuras mēneša komponents tiks izgūts.
ms_my: Nilai tarikh daripadanya komponen bulan akan diekstrak.
nb_no: Datoverdien som minuttkomponenten blir trukket ut fra.
nl_nl: De datumwaarde waaruit het maandgedeelte wordt geëxtraheerd.
pl_pl: Wartość daty, z której zostanie wyodrębniony składnik miesiąca.
pt_br: Valor de data do qual o componente de mês será extraído.
pt_pt: O valor de data a partir do qual o componente mês será extraído.
ro_ro: Valoarea dată din care va fi extrasă componenta lună.
ru_ru: Значение даты, из которого будет извлекаться компонент месяца.
sk_sk: Dátumová hodnota, z ktorej sa vyextrahuje komponent mesiaca.
sl_si: Datumska vrednost, iz katere bo izvlečena komponenta mesec.
sr_cyrl_rs: Вредност датума из које ће компонента месеца бити издвојена.
sr_latn_rs: Vrednost datuma iz koje će komponenta meseca biti izdvojena.
sv_se: Datumvärdet som månadskomponenten kommer att extraheras från.
th_th: ค่าวันที่ที่จะถูกแยกจากคอมโพเนนท์ month
tr_tr: Ay bileşeninin ayıklanacağı tarih değeri.
uk_ua: Значення дати, звідки потрібно видобути компонент місяця.
vi_vn: Giá trị ngày, trong đó thành phần tháng sẽ được trích xuất.
zh_cn: 将从中提取月份部分的日期值。
zh_tw: 將擷取其月份元件的日期值。

# AboutDay
source: Day returns the day of the month, a number from 1 to 31.
bg_bg: Day връща денят от месеца като число от 1 до 31.
ca_es: Dia retorna el dia del mes, un nombre de l'1 al 31.
cs_cz: Funkce Day vrátí den v měsíci, tedy číslo od 1 do 31.
da_dk: Dag returnerer dagen i måneden, et tal fra 1 til 31.
de_de: "Tag" gibt den Tag des Monats zurück, eine Zahl von 1 bis 31.
el_gr: Η Ημέρα επιστρέφει την ημέρα του μήνα, έναν αριθμό από 1 έως 31.
es_es: Día devuelve el día del mes, un número de 1 a 31.
et_ee: Päev tagastab kuupäeva (arvu vahemikus 1–31).
eu_es: "Day" funtzioak hilaren egunak (1 eta 31 arteko zenbaki bat) itzultzen ditu.
fi_fi: Päivä palauttaa kuukauden päivän lukuna 1–31.
fr_fr: Jour retourne le jour du mois, un nombre compris entre 1 et 31.
gl_es: Día devolve o día do mes, un número do 1 ao 31.
hi_in: दिन, माह का दिन लौटाता है, जो कि 1 से 31 तक की संख्या है.
hr_hr: Funkcija Day vraća dan u mjesecu, broj od 1 do 31.
hu_hu: A Day a hónap napját adja eredményül (ez egy 1 és 31 közötti szám).
it_it: Giorno restituisce il giorno del mese, con un numero compreso tra 1 e 31.
ja_jp: Day は、月の日付を返します。1 から 31 までの数値です。
kk_kz: Күн 1 және 31 аралығындағы сан болатын ай күнін қайтарады.
ko_kr: 일은 1 ~ 31 사이의 일을 반환합니다.
lt_lt: Diena pateikia mėnesio dieną – skaičių nuo 1 iki 31.
lv_lv: Diena atgriež mēneša dienu, skaitli no 1 līdz 31.
ms_my: Hari mengembalikan hari bagi bulan, nombor dari 1 hingga 31.
nb_no: Dag returnerer dagen i måneden, et tall fra 1 til 31.
nl_nl: Met Dag wordt de dag van de maand geretourneerd, een getal van 1 tot 31.
pl_pl: Funkcja Day zwraca dzień miesiąca w postaci liczby od 1 do 31.
pt_br: Day retorna o dia do mês, um número de 1 a 31.
pt_pt: O dia devolve o dia do mês, um número entre 1 e 31.
ro_ro: Zi returnează ziua din lună, un număr cuprins între 1 și 31.
ru_ru: Функция Day возвращает день месяца: число от 1 до 31.
sk_sk: Funkcia Day vráti názov dňa v mesiaci, číslo je v rozsahu 1 až 31.
sl_si: Funkcija »Day« vrne dan v mesecu, število med 1 in 31.
sr_cyrl_rs: Да враћа дан у месецу, број од 1 до 31.
sr_latn_rs: Da vraća dan u mesecu, broj od 1 do 31.
sv_se: Dag returnerar dagen i månaden, ett tal från 1 till 31.
th_th: Day คืนค่าวันที่ของเดือนเป็นตัวเลขจาก 1 ถึง 31
tr_tr: Gün, ayın gününü (1 ila 31 arasında bir sayı) döndürür.
uk_ua: Функція "День" повертає день місяця (число від 1 до 31).
vi_vn: Ngày trả về ngày trong tháng, một số trong khoảng từ 1 đến 31.
zh_cn: Day 返回一月中的日期，1 到 31 的数字。
zh_tw: Day 會傳回當月的某一天 (從 1 到 31 的數字)。

# DayArg1
source: date_time
bg_bg: дата_и_час
ca_es: data_hora
cs_cz: datum_čas
da_dk: dato_klokkeslæt
de_de: Datum_Uhrzeit
el_gr: ημερομηνία_ώρα
es_es: fecha_hora
et_ee: kuupäev_ja_kellaaeg
eu_es: data_ordua
fi_fi: päivämäärän_kellonaika
fr_fr: date_heure
gl_es: data_hora
hi_in: दिनांक_समय
hr_hr: datum_vrijeme
hu_hu: dátum_idő
it_it: data_ora
ja_jp: 日時
kk_kz: күн_уақыт
ko_kr: 날짜_시간
lt_lt: data_laikas
lv_lv: datums_laiks
ms_my: tarikh_masa
nb_no: dato_klokkeslett
nl_nl: datum_tijd
pl_pl: data_godzina
pt_br: data_hora
pt_pt: data_hora
ro_ro: data_ora
ru_ru: дата_и_время
sk_sk: dátum_čas
sl_si: datum_ura
sr_cyrl_rs: датум_време
sr_latn_rs: datum_vreme
sv_se: datum_tid
th_th: วันที่_เวลา
tr_tr: tarih_saat
uk_ua: дата_час
vi_vn: ngày_giờ
zh_cn: 日期时间
zh_tw: 日期_時間

# AboutDay_date_time
source: The date value from which the day component will be extracted.
bg_bg: Стойността на дата, от която ще се извлече компонентът на деня.
ca_es: El valor de data del qual s'extraurà el component de dia.
cs_cz: Hodnota kalendářního data, ze které bude extrahována složka dne
da_dk: Datoværdien, hvorfra dag-komponenten bliver udtrukket.
de_de: Der Datumswert, aus dem die Tageskomponente extrahiert werden soll.
el_gr: Η τιμή ημερομηνίας από την οποία θα εξαχθεί το στοιχείο ημέρας.
es_es: Valor de fecha del que se va a extraer el componente de día.
et_ee: Kuupäevaväärtus, millest ekstraktitakse päevakomponent.
eu_es: Egun-osagaia ateratzeko erabiliko den data-balioa.
fi_fi: Päivämääräarvo, josta päiväkomponentti poimitaan.
fr_fr: Valeur de date dont le composant jour sera extrait.
gl_es: Valor de data do que se vai extraer o compoñente "día".
hi_in: वह दिनांक मान जिससे दिन घटक निकाला जाएगा.
hr_hr: Vrijednost datuma iz koje će se komponenta dana izdvojiti.
hu_hu: Az a dátumérték, amelyből a függvény kinyeri a nap összetevőt.
it_it: Valore data dal quale verrà estratto il componente relativo al giorno.
ja_jp: 日コンポーネントを抽出する元となる日付の値。
kk_kz: Күн компоненті алынатын күн мәні.
ko_kr: 일 구성 요소가 추출되는 날짜 값입니다.
lt_lt: Datos reikšmė, iš kurios bus išgautas dienos komponentas.
lv_lv: Datuma vērtība, no kuras dienas komponents tiks izgūts.
ms_my: Nilai tarikh yang komponen harinya akan diekstrak.
nb_no: Datoverdien som dagskomponenten trekkes ut fra.
nl_nl: De datumwaarde waaraan de het dagonderdeel wordt geëxtraheerd.
pl_pl: Wartość daty, z której zostanie wyodrębniony składnik dnia.
pt_br: O valor de data do qual o componente de dia será extraído.
pt_pt: O valor de data a partir do qual o componente de dia será extraído.
ro_ro: Valoarea dată din care va fi extrasă componenta zi.
ru_ru: Значение даты, из которого будет извлекаться компонент дня.
sk_sk: Dátumová hodnota, z ktorej sa vyextrahuje komponent dňa.
sl_si: Datumska vrednost, iz katere bo izvlečena komponenta dan.
sr_cyrl_rs: Вредност датума из које ће компонента дана бити издвојена.
sr_latn_rs: Vrednost datuma iz koje će komponenta dana biti izdvojena.
sv_se: Datumvärdet som dagkomponenten extraheras från.
th_th: ค่าวันที่ที่จะถูกแยกจากคอมโพเนนท์ Day
tr_tr: Gün bileşeninin ayıklanacağı tarih değeri.
uk_ua: Значення дати, з якого потрібно видобувати компонент дня.
vi_vn: Giá trị ngày mà cấu phần ngày sẽ được trích xuất từ đó.
zh_cn: 将从中提取星期几部分的日期值。
zh_tw: 擷取其中「日」部分元件的日期值。

# AboutHour
source: Hour returns the hour as a number between 0 (12:00:00 AM) and 23 (11:00:00 PM).
bg_bg: Функцията „Час“ връща часа като число между 0 (12:00 ч) и 23 (11:00 ч).
ca_es: L'hora retorna l'hora com un nombre entre 0 (12:00:00 de la matinada) i 23 (11:00:00 de la nit).
cs_cz: Funkce Hour vrátí hodinu jako číslo mezi 0 a 23.
da_dk: Timer returnerer timen som et tal mellem 0 (12:00:00 AM) og 23 (11:00:00 PM).
de_de: "Hour" gibt die Stunde als Zahl zwischen 0 (Mitternacht) und 23 (11 Uhr nachts) zurück.
el_gr: Η Ώρα επιστρέφει την ώρα ως αριθμό μεταξύ 0 (12:00:00 π.μ.) και 23 (11:00:00 μ.μ.).
es_es: Hora devuelve la hora como un número entre 0 (12:00:00 AM) y 23 (11:00:00 PM).
et_ee: Tund tagastab tunni arvuna vahemikus 0 (12:00:00 AM) kuni 23 (11:00:00 PM).
eu_es: "Hour" funtzioak 0 (12:00:00 a.m.) eta 23 (11:00:00 p.m.) balioen arteko ordua itzultzen du zenbaki gisa.
fi_fi: Tunti palauttaa tunnin lukuna välillä 0 (00.00.00) ja 23 (23.00.00).
fr_fr: La fonction Heure retourne l’heure sous forme de nombre compris entre 0 (00:00:00) et 23 (23:00:00).
gl_es: Hora devolve a hora como un número entre 0 (12:00:00 AM) e 23 (11:00:00 PM).
hi_in: घंटा 0 (12:00:00 AM) और 23 (11:00:00 PM) के बीच की संख्या घंटे के रूप में लौटाता है.
hr_hr: Funkcija Hour vraća sat kao broj između 0 (12:00:00) i 23 (23:00:00).
hu_hu: A Hour az órát adja vissza egy 0 (00:00:00) és 23 (23:00:00) közötti szám formájában.
it_it: Ora restituisce l'ora sotto forma di numero compreso tra 0 (12:00:00 AM) e 23 (11:00:00 PM).
ja_jp: 時間は、0 (12:00:00 AM) から 23 (11:00:00 PM) までの範囲の数値として時刻を返します。
kk_kz: Сағат 0 (12:00:00 түске дейін) және 23 (11:00:00 түстен кейін) арасындағы сан түріндегі сағатты қайтарады.
ko_kr: 시간은 0(12:00:00AM) ~ 23(11:00:00PM) 사이의 숫자로 시간을 반환합니다.
lt_lt: Parametras „Valanda“ pateikia valandas kaip skaičių nuo 0 (00:00:00) iki 23 (23:00:00).
lv_lv: Stunda atgriež stundu kā skaitli no 0 (12:00:00 AM) līdz 23 (11:00:00 PM).
ms_my: Jam mengembalikan jam sebagai nombor di antara 0 (12:00:00 PG) dan 23 (11:00:00 MLM).
nb_no: Time returnerer timen som et tall mellom 0 (12:00:00 AM) og 23 (11:00:00 PM).
nl_nl: Met Uren wordt het uur geretourneerd als getal tussen 0 (12:00:00 AM) en 23 (11:00:00 PM).
pl_pl: Funkcja hour zwraca godzinę jako liczbę od 0 (00:00:00) do 23 (23:00:00).
pt_br: Hour retorna a hora como um número entre 0 (12:00:00 AM) e 23 (11:00:00 PM).
pt_pt: A hora devolve a hora como um número entre 0 (12:00:00 AM) e 23 (11:00:00 PM).
ro_ro: Oră returnează ora ca număr cuprins între 0 (12:00:00) și 23 (23:00:00).
ru_ru: Функция Hour возвращает час в виде числа от 0 (00:00) до 23 (23:00).
sk_sk: Funkcia Hour vráti hodinu ako číslo v rozsahu 0 (12:00:00 AM) až 23 (11:00:00 PM).
sl_si: »Hour« vrne uro kot številko med 0 (00:00:00) in 23 (23:00:00).
sr_cyrl_rs: Час враћа час као број између 0 (12:00:00 AM) и 23 (11:00:00 PM).
sr_latn_rs: Čas vraća čas kao broj između 0 (12:00:00 AM) i 23 (11:00:00 PM).
sv_se: Timme returnerar timmen som ett tal mellan 0 (12:00:00 AM) och 23 (11:00:00 PM).
th_th: ชั่วโมงจะคืนค่าชั่วโมงเป็นตัวเลขระหว่าง 0 (12:00:00 ก่อนเที่ยง) และ 23 (11:00:00 หลังเที่ยง)
tr_tr: Hour işlevi, saati 0 (00:00:00) ile 23 (23:00:00) arasında bir sayı olarak döndürür.
uk_ua: Функція "Година" овертає годину як число від 0 (00:00:00) до 23 (23:00:00)
vi_vn: Giờ trả về giờ ở dạng số trong khoảng từ 0 (12:00:00 SA) đến 23 (11:00:00 CH).
zh_cn: Hour 以介于 0 (凌晨 12:00:00)与 23 (晚上 11:00:00)之间的数字形式返回小时。
zh_tw: Hour 會以數字方式傳回介於 0 (上午 12:00:00) 到 23 (下午 11:00:00) 之間的小時。
